alvaro-tc/esp32-ili9341-controller/lib/NRF24Controller/NRF24Controller.cpp
/**
 * NRF24Controller Library Implementation
 * 
 * Author: GitHub Copilot
 * Date: 2025
 */

#include "NRF24Controller.h"

// Constructor
NRF24Controller::NRF24Controller(uint8_t cePin, uint8_t csnPin) {
    _cePin = cePin;
    _csnPin = csnPin;
    _radio = new RF24(cePin, csnPin);
    
    // Default configuration
    _channel = 76;
    _powerLevel = POWER_HIGH;
    _dataRate = RATE_1MBPS;
    _txAddress = 0xE8E8F0F0E1LL;
    _rxAddress = 0xE8E8F0F0E2LL;
    
    // Initialize control arrays
    _joystickCount = 0;
    _leverCount = 0;
    for (int i = 0; i < MAX_JOYSTICKS; i++) {
        _joysticks[i] = nullptr;
        _joystickEnabled[i] = true;
    }
    for (int i = 0; i < MAX_LEVERS; i++) {
        _levers[i] = nullptr;
        _leverEnabled[i] = true;
    }
    
    // Packet configuration
    _packetCounter = 0;
    _autoSend = false;
    _sendInterval = 50;
    _lastSendTime = 0;
    
    // Transmission settings
    _enableAck = true;
    _retryCount = 15;
    _retryDelay = 5;
    
    // Data filtering
    _joystickThreshold = 5;
    _leverThreshold = 5;
    _sendOnlyChanges = true;
    
    // Initialize stats
    memset(&_stats, 0, sizeof(_stats));
    
    // Initialize last data arrays
    memset(_lastJoystickData, 0, sizeof(_lastJoystickData));
    memset(_lastLeverData, 0, sizeof(_lastLeverData));
    
    // Initialize profile system
    _activeProfile = 0;
    _profileCount = 0;
    _lastProfileExecution = 0;
    memset(_channelValues, 0, sizeof(_channelValues));
    memset(_channelUpdated, false, sizeof(_channelUpdated));
    _initializeProfiles();
}

// Initialize the NRF24L01
bool NRF24Controller::begin() {
    if (!_radio->begin()) {
        Serial.println("NRF24Controller: Failed to initialize radio");
        return false;
    }
    
    _initializeRadio();
    
    Serial.println("NRF24Controller: Initialized successfully");
    return true;
}

void NRF24Controller::_initializeRadio() {
    _radio->setPALevel(_powerLevel);
    
    // Convertir DataRate personalizado a rf24_datarate_e
    rf24_datarate_e rf24_rate;
    switch (_dataRate) {
        case RATE_250KBPS: rf24_rate = RF24_250KBPS; break;
        case RATE_1MBPS: rf24_rate = RF24_1MBPS; break;
        case RATE_2MBPS: rf24_rate = RF24_2MBPS; break;
        default: rf24_rate = RF24_1MBPS; break;
    }
    _radio->setDataRate(rf24_rate);
    
    _radio->setChannel(_channel);
    _radio->enableAckPayload();
    _radio->setRetries(_retryDelay, _retryCount);
    _radio->setPayloadSize(sizeof(DataPacket));
    
    _radio->openWritingPipe(_txAddress);
    _radio->openReadingPipe(1, _rxAddress);
    
    _radio->powerUp();
    _radio->stopListening(); // Start in transmit mode by default
}

// Configuration methods
void NRF24Controller::setChannel(uint8_t channel) {
    _channel = constrain(channel, 0, 125);
    _radio->setChannel(_channel);
}

void NRF24Controller::setPowerLevel(PowerLevel level) {
    _powerLevel = level;
    _radio->setPALevel(_powerLevel);
}

void NRF24Controller::setDataRate(DataRate rate) {
    _dataRate = rate;
    
    // Convertir DataRate personalizado a rf24_datarate_e
    rf24_datarate_e rf24_rate;
    switch (_dataRate) {
        case RATE_250KBPS: rf24_rate = RF24_250KBPS; break;
        case RATE_1MBPS: rf24_rate = RF24_1MBPS; break;
        case RATE_2MBPS: rf24_rate = RF24_2MBPS; break;
        default: rf24_rate = RF24_1MBPS; break;
    }
    _radio->setDataRate(rf24_rate);
}

void NRF24Controller::setAddresses(uint64_t txAddr, uint64_t rxAddr) {
    _txAddress = txAddr;
    _rxAddress = rxAddr;
    _radio->openWritingPipe(_txAddress);
    _radio->openReadingPipe(1, _rxAddress);
}

void NRF24Controller::enableAckPayload(bool enable) {
    _enableAck = enable;
    if (enable) {
        _radio->enableAckPayload();
    } else {
        _radio->disableAckPayload();
    }
}

void NRF24Controller::setRetrySettings(uint8_t count, uint8_t delay) {
    _retryCount = constrain(count, 0, 15);
    _retryDelay = constrain(delay, 0, 15);
    _radio->setRetries(_retryDelay, _retryCount);
}

// Control management
bool NRF24Controller::addJoystick(Joystick* joystick, uint8_t id) {
    if (id >= MAX_JOYSTICKS || _joysticks[id] != nullptr) {
        return false;
    }
    
    _joysticks[id] = joystick;
    _joystickEnabled[id] = true;
    _joystickCount++;
    
    // Initialize last data
    _lastJoystickData[id].id = id;
    _lastJoystickData[id].type = CONTROL_JOYSTICK;
    
    return true;
}

bool NRF24Controller::addLever(Lever* lever, uint8_t id) {
    if (id >= MAX_LEVERS || _levers[id] != nullptr) {
        return false;
    }
    
    _levers[id] = lever;
    _leverEnabled[id] = true;
    _leverCount++;
    
    // Initialize last data
    _lastLeverData[id].id = id;
    switch (lever->getLeverType()) {
        case ANALOG_LEVER:
            _lastLeverData[id].type = CONTROL_LEVER_ANALOG;
            break;
        case ROTARY_ENCODER:
            _lastLeverData[id].type = CONTROL_LEVER_ENCODER;
            break;
        case DIGITAL_LEVER:
            _lastLeverData[id].type = CONTROL_LEVER_DIGITAL;
            break;
    }
    
    return true;
}

void NRF24Controller::removeJoystick(uint8_t id) {
    if (id < MAX_JOYSTICKS && _joysticks[id] != nullptr) {
        _joysticks[id] = nullptr;
        _joystickEnabled[id] = false;
        _joystickCount--;
    }
}

void NRF24Controller::removeLever(uint8_t id) {
    if (id < MAX_LEVERS && _levers[id] != nullptr) {
        _levers[id] = nullptr;
        _leverEnabled[id] = false;
        _leverCount--;
    }
}

void NRF24Controller::enableJoystick(uint8_t id, bool enable) {
    if (id < MAX_JOYSTICKS) {
        _joystickEnabled[id] = enable;
    }
}

void NRF24Controller::enableLever(uint8_t id, bool enable) {
    if (id < MAX_LEVERS) {
        _leverEnabled[id] = enable;
    }
}

// Transmission settings
void NRF24Controller::setAutoSend(bool enable, unsigned long interval) {
    _autoSend = enable;
    _sendInterval = interval;
}

void NRF24Controller::setSendThresholds(int joystickThreshold, int leverThreshold) {
    _joystickThreshold = joystickThreshold;
    _leverThreshold = leverThreshold;
}

