alvaro-tc/esp32-ili9341-controller/lib/NRF24Controller/NRF24Controller.cpp
void NRF24Controller::setSendOnlyChanges(bool enable) {
    _sendOnlyChanges = enable;
}

// Update control data
void NRF24Controller::_updateControlData() {
    clearPacket();
    
    // Add joystick data
    for (uint8_t i = 0; i < MAX_JOYSTICKS; i++) {
        if (_joysticks[i] != nullptr && _joystickEnabled[i]) {
            int16_t x = _joysticks[i]->readX();
            int16_t y = _joysticks[i]->readY();
            uint8_t flags = 0;
            
            if (_joysticks[i]->isPressed()) flags |= 0x01;
            if (_joysticks[i]->isNeutral()) flags |= 0x02;
            if (_joysticks[i]->isAtEdge()) flags |= 0x04;
            
            // Check if data changed significantly
            bool changed = !_sendOnlyChanges ||
                          abs(x - _lastJoystickData[i].valueX) >= _joystickThreshold ||
                          abs(y - _lastJoystickData[i].valueY) >= _joystickThreshold ||
                          flags != _lastJoystickData[i].flags;
            
            if (changed) {
                addToPacket(i, CONTROL_JOYSTICK, x, y, flags);
                _lastJoystickData[i].valueX = x;
                _lastJoystickData[i].valueY = y;
                _lastJoystickData[i].flags = flags;
            }
        }
    }
    
    // Add lever data
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        if (_levers[i] != nullptr && _leverEnabled[i]) {
            int16_t position = _levers[i]->readPosition();
            int16_t velocity = (int16_t)_levers[i]->readVelocity();
            uint8_t flags = 0;
            
            if (_levers[i]->isPressed()) flags |= 0x01;
            if (_levers[i]->isAtCenter()) flags |= 0x02;
            if (_levers[i]->isAtMinimum()) flags |= 0x04;
            if (_levers[i]->isAtMaximum()) flags |= 0x08;
            if (_levers[i]->isMoving()) flags |= 0x10;
            
            // Check if data changed significantly
            bool changed = !_sendOnlyChanges ||
                          abs(position - _lastLeverData[i].valueX) >= _leverThreshold ||
                          flags != _lastLeverData[i].flags;
            
            if (changed) {
                addToPacket(i + 100, _lastLeverData[i].type, position, velocity, flags);
                _lastLeverData[i].valueX = position;
                _lastLeverData[i].valueY = velocity;
                _lastLeverData[i].flags = flags;
            }
        }
    }
}

// Check if any data has changed
bool NRF24Controller::_hasDataChanged() {
    for (uint8_t i = 0; i < MAX_JOYSTICKS; i++) {
        if (_joysticks[i] != nullptr && _joystickEnabled[i]) {
            int16_t x = _joysticks[i]->readX();
            int16_t y = _joysticks[i]->readY();
            
            if (abs(x - _lastJoystickData[i].valueX) >= _joystickThreshold ||
                abs(y - _lastJoystickData[i].valueY) >= _joystickThreshold) {
                return true;
            }
        }
    }
    
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        if (_levers[i] != nullptr && _leverEnabled[i]) {
            int16_t position = _levers[i]->readPosition();
            
            if (abs(position - _lastLeverData[i].valueX) >= _leverThreshold) {
                return true;
            }
        }
    }
    
    return false;
}

// Calculate checksum
uint16_t NRF24Controller::_calculateChecksum(const DataPacket& packet) {
    uint16_t checksum = 0;
    const uint8_t* data = (const uint8_t*)&packet;
    
    // Calculate checksum for all data except the checksum field itself
    for (size_t i = 0; i < sizeof(DataPacket) - sizeof(uint16_t); i++) {
        checksum ^= data[i];
        checksum = (checksum << 1) | (checksum >> 15); // Rotate left
    }
    
    return checksum;
}

// Update transmission statistics
void NRF24Controller::_updateStats(bool success) {
    if (success) {
        _stats.packetsSent++;
    } else {
        _stats.packetsLost++;
    }
    
    _stats.lastTransmissionTime = millis();
    
    uint32_t totalAttempts = _stats.packetsSent + _stats.packetsLost;
    if (totalAttempts > 0) {
        _stats.successRate = (float)_stats.packetsSent / totalAttempts * 100.0;
    }
}

// Main update function - call this in loop()
void NRF24Controller::update() {
    // Update levers (important for encoders)
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        if (_levers[i] != nullptr) {
            _levers[i]->update();
        }
    }
    
    // Auto-send if enabled
    if (_autoSend && (millis() - _lastSendTime >= _sendInterval)) {
        if (!_sendOnlyChanges || _hasDataChanged()) {
            sendData();
        }
        _lastSendTime = millis();
    }
}

// Send current control data
bool NRF24Controller::sendData() {
    _updateControlData();
    
    if (_currentPacket.controlCount == 0) {
        return true; // Nothing to send
    }
    
    _currentPacket.packetId = _packetCounter++;
    _currentPacket.timestamp = millis();
    _currentPacket.checksum = _calculateChecksum(_currentPacket);
    
    _radio->stopListening();
    bool result = _radio->write(&_currentPacket, sizeof(DataPacket));
    
    _updateStats(result);
    
    if (result) {
        Serial.print("Sent packet #");
        Serial.print(_currentPacket.packetId);
        Serial.print(" with ");
        Serial.print(_currentPacket.controlCount);
        Serial.println(" controls");
    }
    
    return result;
}

// Send custom control data
bool NRF24Controller::sendCustomData(const ControlData& data) {
    clearPacket();
    _currentPacket.controls[0] = data;
    _currentPacket.controlCount = 1;
    _currentPacket.packetId = _packetCounter++;
    _currentPacket.timestamp = millis();
    _currentPacket.checksum = _calculateChecksum(_currentPacket);
    
    _radio->stopListening();
    bool result = _radio->write(&_currentPacket, sizeof(DataPacket));
    _updateStats(result);
    
    return result;
}

// Send custom packet
bool NRF24Controller::sendCustomPacket(const DataPacket& packet) {
    _radio->stopListening();
    bool result = _radio->write(&packet, sizeof(DataPacket));
    _updateStats(result);
    
    return result;
}

