alvaro-tc/esp32-ili9341-controller/lib/NRF24Controller/NRF24Controller.cpp
// Check if data is available
bool NRF24Controller::available() {
    _radio->startListening();
    return _radio->available();
}

// Read received data
bool NRF24Controller::readData(DataPacket& packet) {
    if (!available()) {
        return false;
    }
    
    _radio->read(&packet, sizeof(DataPacket));
    bool result = true;
    
    if (result) {
        // Verify checksum
        uint16_t calculatedChecksum = _calculateChecksum(packet);
        if (calculatedChecksum == packet.checksum) {
            _stats.packetsReceived++;
            return true;
        } else {
            Serial.println("Checksum mismatch - packet corrupted");
            return false;
        }
    }
    
    return false;
}

// Read specific control data from last received packet
bool NRF24Controller::readControlData(uint8_t controlId, ControlData& data) {
    // This would require storing the last received packet
    // Implementation depends on your specific needs
    return false; // Placeholder
}

// Packet management
void NRF24Controller::clearPacket() {
    memset(&_currentPacket, 0, sizeof(DataPacket));
    _currentPacket.controlCount = 0;
}

void NRF24Controller::addToPacket(uint8_t controlId, ControlType type, int16_t valueX, int16_t valueY, uint8_t flags) {
    if (_currentPacket.controlCount >= 8) {
        return; // Packet full
    }
    
    ControlData& control = _currentPacket.controls[_currentPacket.controlCount];
    control.id = controlId;
    control.type = type;
    control.valueX = valueX;
    control.valueY = valueY;
    control.flags = flags;
    control.timestamp = millis();
    
    _currentPacket.controlCount++;
}

uint8_t NRF24Controller::getPacketSize() {
    return _currentPacket.controlCount;
}

// Status and diagnostics
bool NRF24Controller::isConnected() {
    return _radio->isChipConnected();
}

TransmissionStats NRF24Controller::getStats() {
    return _stats;
}

void NRF24Controller::resetStats() {
    memset(&_stats, 0, sizeof(_stats));
}

float NRF24Controller::getSignalQuality() {
    return _stats.successRate;
}

void NRF24Controller::printStatus() {
    Serial.println("=== NRF24Controller Status ===");
    Serial.print("Channel: "); Serial.println(_channel);
    Serial.print("Power Level: "); Serial.println(_powerLevel);
    Serial.print("Data Rate: "); Serial.println(_dataRate);
    Serial.print("Connected: "); Serial.println(isConnected() ? "Yes" : "No");
    Serial.print("Joysticks: "); Serial.println(_joystickCount);
    Serial.print("Levers: "); Serial.println(_leverCount);
    Serial.print("Auto Send: "); Serial.println(_autoSend ? "Enabled" : "Disabled");
    Serial.print("Send Interval: "); Serial.print(_sendInterval); Serial.println("ms");
    Serial.print("Packets Sent: "); Serial.println(_stats.packetsSent);
    Serial.print("Packets Lost: "); Serial.println(_stats.packetsLost);
    Serial.print("Success Rate: "); Serial.print(_stats.successRate, 1); Serial.println("%");
}

void NRF24Controller::printPacket(const DataPacket& packet) {
    Serial.print("Packet ID: "); Serial.println(packet.packetId);
    Serial.print("Controls: "); Serial.println(packet.controlCount);
    Serial.print("Timestamp: "); Serial.println(packet.timestamp);
    
    for (uint8_t i = 0; i < packet.controlCount; i++) {
        const ControlData& control = packet.controls[i];
        Serial.print("  Control "); Serial.print(control.id);
        Serial.print(" Type: "); Serial.print(control.type);
        Serial.print(" X: "); Serial.print(control.valueX);
        Serial.print(" Y: "); Serial.print(control.valueY);
        Serial.print(" Flags: 0x"); Serial.println(control.flags, HEX);
    }
}

// Advanced configuration methods
void NRF24Controller::setPayloadSize(uint8_t size) {
    _radio->setPayloadSize(constrain(size, 1, 32));
}

void NRF24Controller::enableDynamicPayloads(bool enable) {
    if (enable) {
        _radio->enableDynamicPayloads();
    }
}

void NRF24Controller::enableAutoAck(bool enable) {
    _radio->setAutoAck(enable);
}

void NRF24Controller::openWritingPipe(uint64_t address) {
    _txAddress = address;
    _radio->openWritingPipe(address);
}

void NRF24Controller::openReadingPipe(uint8_t pipe, uint64_t address) {
    _radio->openReadingPipe(pipe, address);
}

void NRF24Controller::startListening() {
    _radio->startListening();
}

void NRF24Controller::stopListening() {
    _radio->stopListening();
}

// Utility methods
void NRF24Controller::powerUp() {
    _radio->powerUp();
}

void NRF24Controller::powerDown() {
    _radio->powerDown();
}

bool NRF24Controller::testConnection() {
    return _radio->isChipConnected();
}

void NRF24Controller::scanChannels() {
    Serial.println("Scanning channels for interference...");
    
    _radio->startListening();
    _radio->stopListening();
    
    for (uint8_t channel = 0; channel <= 125; channel++) {
        _radio->setChannel(channel);
        _radio->startListening();
        delayMicroseconds(128);
        bool result = _radio->testCarrier();
        _radio->stopListening();
        
        if (channel % 20 == 0) Serial.println();
        Serial.print(result ? "1" : "0");
    }
    
    Serial.println();
    _radio->setChannel(_channel); // Restore original channel
}

uint8_t NRF24Controller::getOptimalChannel() {
    uint8_t bestChannel = _channel;
    uint8_t minInterference = 255;
    
    for (uint8_t channel = 0; channel <= 125; channel += 5) {
        _radio->setChannel(channel);
        _radio->startListening();
        
        uint8_t interference = 0;
        for (int i = 0; i < 100; i++) {
            if (_radio->testCarrier()) {
                interference++;
            }
            delayMicroseconds(10);
        }
        
        _radio->stopListening();
        
        if (interference < minInterference) {
            minInterference = interference;
            bestChannel = channel;
        }
    }
    
    _radio->setChannel(_channel); // Restore original channel
    Serial.print("Optimal channel: ");
    Serial.print(bestChannel);
    Serial.print(" (interference level: ");
    Serial.print(minInterference);
    Serial.println(")");
    
    return bestChannel;
}

// ========== PROFILE MANAGEMENT SYSTEM IMPLEMENTATION ==========

void NRF24Controller::_initializeProfiles() {
    // Initialize all profiles
    for (uint8_t i = 0; i < 4; i++) {
        memset(&_profiles[i], 0, sizeof(ControlProfile));
        _profiles[i].enabled = false;
        _profiles[i].autoExecute = false;
        _profiles[i].executeInterval = 50;
        
        // Initialize mappings with default values
        for (uint8_t j = 0; j < MAX_JOYSTICKS; j++) {
            _profiles[i].joystickMappings[j][0] = {0, -100, 100, 0, false, 1.0, false}; // X axis
            _profiles[i].joystickMappings[j][1] = {1, -100, 100, 0, false, 1.0, false}; // Y axis
        }
        
        for (uint8_t j = 0; j < MAX_LEVERS; j++) {
            _profiles[i].leverMappings[j] = {(uint8_t)(j + 10), 0, 100, 50, false, 1.0, false};
        }
    }
}

uint8_t NRF24Controller::createProfile(const char* name) {
    if (_profileCount >= 4) {
        Serial.println("Maximum profiles reached (4)");
        return 255; // Error
    }
    
    uint8_t index = _profileCount++;
    strncpy(_profiles[index].name, name, 15);
    _profiles[index].name[15] = '\0';
    _profiles[index].enabled = true;
    _profiles[index].autoExecute = true;
    _profiles[index].executeInterval = 50;
    _profiles[index].conditionalCount = 0;
    
    Serial.print("Created profile '");
    Serial.print(name);
    Serial.print("' at index ");
    Serial.println(index);
    
    return index;
}

bool NRF24Controller::selectProfile(uint8_t profileIndex) {
    if (profileIndex >= _profileCount) {
        Serial.println("Profile index out of range");
        return false;
    }
    
    _activeProfile = profileIndex;
    Serial.print("Active profile: ");
    Serial.println(_profiles[profileIndex].name);
    return true;
}

bool NRF24Controller::selectProfile(const char* name) {
    for (uint8_t i = 0; i < _profileCount; i++) {
        if (strcmp(_profiles[i].name, name) == 0) {
            return selectProfile(i);
        }
    }
    
