alvaro-tc/esp32-ili9341-controller/lib/NRF24Controller/NRF24Controller.cpp
    Serial.print("Profile '");
    Serial.print(name);
    Serial.println("' not found");
    return false;
}

void NRF24Controller::enableProfile(uint8_t profileIndex, bool enable) {
    if (profileIndex < _profileCount) {
        _profiles[profileIndex].enabled = enable;
    }
}

void NRF24Controller::deleteProfile(uint8_t profileIndex) {
    if (profileIndex >= _profileCount) return;
    
    // Shift profiles down
    for (uint8_t i = profileIndex; i < _profileCount - 1; i++) {
        _profiles[i] = _profiles[i + 1];
    }
    _profileCount--;
    
    // Adjust active profile if necessary
    if (_activeProfile >= _profileCount && _profileCount > 0) {
        _activeProfile = _profileCount - 1;
    }
}

// SIMPLE MAPPING FUNCTIONS (SUPER EASY TO USE!)
void NRF24Controller::mapJoystickToChannel(uint8_t joystickId, bool xAxis, uint8_t channel, 
                                          int16_t minVal, int16_t maxVal) {
    if (joystickId >= MAX_JOYSTICKS || _activeProfile >= _profileCount) return;
    
    ControlMapping* mapping = &_profiles[_activeProfile].joystickMappings[joystickId][xAxis ? 0 : 1];
    mapping->outputChannel = channel;
    mapping->minValue = minVal;
    mapping->maxValue = maxVal;
    mapping->centerValue = (minVal + maxVal) / 2;
    mapping->invertOutput = false;
    mapping->scaleFactor = 1.0;
    mapping->enabled = true;
    
    Serial.print("Mapped Joystick ");
    Serial.print(joystickId);
    Serial.print(xAxis ? " X-axis" : " Y-axis");
    Serial.print(" to channel ");
    Serial.print(channel);
    Serial.print(" (");
    Serial.print(minVal);
    Serial.print(" to ");
    Serial.print(maxVal);
    Serial.println(")");
}

void NRF24Controller::mapLeverToChannel(uint8_t leverId, uint8_t channel, 
                                       int16_t minVal, int16_t maxVal) {
    if (leverId >= MAX_LEVERS || _activeProfile >= _profileCount) return;
    
    ControlMapping* mapping = &_profiles[_activeProfile].leverMappings[leverId];
    mapping->outputChannel = channel;
    mapping->minValue = minVal;
    mapping->maxValue = maxVal;
    mapping->centerValue = (minVal + maxVal) / 2;
    mapping->invertOutput = false;
    mapping->scaleFactor = 1.0;
    mapping->enabled = true;
    
    Serial.print("Mapped Lever ");
    Serial.print(leverId);
    Serial.print(" to channel ");
    Serial.print(channel);
    Serial.print(" (");
    Serial.print(minVal);
    Serial.print(" to ");
    Serial.print(maxVal);
    Serial.println(")");
}

// CONDITIONAL MAPPING (ADVANCED FEATURE!)
void NRF24Controller::mapJoystickConditional(uint8_t joystickId, bool xAxis, uint8_t channel,
                                            uint8_t conditionLever, uint8_t leverPosition,
                                            int16_t minVal, int16_t maxVal) {
    if (_activeProfile >= _profileCount || _profiles[_activeProfile].conditionalCount >= 8) {
        return;
    }
    
    ConditionalMapping* conditional = &_profiles[_activeProfile].conditionalMappings[_profiles[_activeProfile].conditionalCount++];
    conditional->conditionLeverId = conditionLever;
    conditional->conditionPosition = leverPosition;
    conditional->mapping.outputChannel = channel;
    conditional->mapping.minValue = minVal;
    conditional->mapping.maxValue = maxVal;
    conditional->mapping.centerValue = (minVal + maxVal) / 2;
    conditional->mapping.invertOutput = false;
    conditional->mapping.scaleFactor = 1.0;
    conditional->mapping.enabled = true;
    
    Serial.print("Conditional: Joystick ");
    Serial.print(joystickId);
    Serial.print(xAxis ? " X" : " Y");
    Serial.print(" -> Channel ");
    Serial.print(channel);
    Serial.print(" when Lever ");
    Serial.print(conditionLever);
    Serial.print(" = ");
    Serial.println(leverPosition);
}

int16_t NRF24Controller::_applyMapping(int16_t inputValue, const ControlMapping& mapping) {
    if (!mapping.enabled) return 0;
    
    // Apply scale factor
    float scaledValue = inputValue * mapping.scaleFactor;
    
    // Map from input range to output range
    int16_t mappedValue = map(scaledValue, -100, 100, mapping.minValue, mapping.maxValue);
    
    // Apply inversion if needed
    if (mapping.invertOutput) {
        mappedValue = mapping.maxValue - mappedValue + mapping.minValue;
    }
    
    return mappedValue;
}

bool NRF24Controller::_checkConditionalMapping(const ConditionalMapping& conditional) {
    if (conditional.conditionLeverId >= MAX_LEVERS || _levers[conditional.conditionLeverId] == nullptr) {
        return false;
    }
    
    // Check if lever is in the required position
    int leverPosition = _levers[conditional.conditionLeverId]->getDigitalPosition();
    return (leverPosition == conditional.conditionPosition);
}

void NRF24Controller::_updateChannelValues() {
    ControlProfile& profile = _profiles[_activeProfile];
    
    // Clear updated flags
    memset(_channelUpdated, false, sizeof(_channelUpdated));
    
    // Process joystick mappings
    for (uint8_t i = 0; i < MAX_JOYSTICKS; i++) {
        if (_joysticks[i] != nullptr && _joystickEnabled[i]) {
            // X axis
            if (profile.joystickMappings[i][0].enabled) {
                int16_t value = _joysticks[i]->readX();
                int16_t mappedValue = _applyMapping(value, profile.joystickMappings[i][0]);
                uint8_t channel = profile.joystickMappings[i][0].outputChannel;
                _channelValues[channel] = mappedValue;
                _channelUpdated[channel] = true;
            }
            
            // Y axis
            if (profile.joystickMappings[i][1].enabled) {
                int16_t value = _joysticks[i]->readY();
                int16_t mappedValue = _applyMapping(value, profile.joystickMappings[i][1]);
                uint8_t channel = profile.joystickMappings[i][1].outputChannel;
                _channelValues[channel] = mappedValue;
                _channelUpdated[channel] = true;
            }
        }
    }
    
