alvaro-tc/esp32-ili9341-controller/lib/NRF24Controller/NRF24Controller.cpp
    // Process lever mappings
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        if (_levers[i] != nullptr && _leverEnabled[i] && profile.leverMappings[i].enabled) {
            int16_t value = _levers[i]->readPosition();
            int16_t mappedValue = _applyMapping(value, profile.leverMappings[i]);
            uint8_t channel = profile.leverMappings[i].outputChannel;
            _channelValues[channel] = mappedValue;
            _channelUpdated[channel] = true;
        }
    }
    
    // Process conditional mappings
    for (uint8_t i = 0; i < profile.conditionalCount; i++) {
        if (_checkConditionalMapping(profile.conditionalMappings[i])) {
            // Apply conditional mapping
            // This is a simplified version - you might want to extend this
            uint8_t channel = profile.conditionalMappings[i].mapping.outputChannel;
            // Apply the conditional limits to existing channel value
            int16_t currentValue = _channelValues[channel];
            int16_t newMin = profile.conditionalMappings[i].mapping.minValue;
            int16_t newMax = profile.conditionalMappings[i].mapping.maxValue;
            _channelValues[channel] = map(currentValue, -100, 100, newMin, newMax);
            _channelUpdated[channel] = true;
        }
    }
}

void NRF24Controller::_executeActiveProfile() {
    if (_activeProfile >= _profileCount || !_profiles[_activeProfile].enabled) {
        return;
    }
    
    ControlProfile& profile = _profiles[_activeProfile];
    
    if (!profile.autoExecute) return;
    
    unsigned long currentTime = millis();
    if (currentTime - _lastProfileExecution < profile.executeInterval) {
        return;
    }
    
    // Update channel values based on current profile
    _updateChannelValues();
    
    // Create and send packet with channel data
    clearPacket();
    
    // Add updated channels to packet
    for (uint8_t i = 0; i < 32; i++) {
        if (_channelUpdated[i]) {
            addToPacket(i, CONTROL_CUSTOM, _channelValues[i], 0, 0);
        }
    }
    
    // Send the data
    if (_currentPacket.controlCount > 0) {
        sendData();
    }
    
    _lastProfileExecution = currentTime;
}

// CHANNEL ACCESS METHODS
int16_t NRF24Controller::getChannelValue(uint8_t channel) {
    if (channel < 32) {
        return _channelValues[channel];
    }
    return 0;
}

void NRF24Controller::setChannelValue(uint8_t channel, int16_t value) {
    if (channel < 32) {
        _channelValues[channel] = value;
        _channelUpdated[channel] = true;
    }
}

bool NRF24Controller::isChannelUpdated(uint8_t channel) {
    if (channel < 32) {
        return _channelUpdated[channel];
    }
    return false;
}

void NRF24Controller::clearChannelUpdated(uint8_t channel) {
    if (channel < 32) {
        _channelUpdated[channel] = false;
    }
}

// AUTO-EXECUTION SYSTEM (SET AND FORGET!)
void NRF24Controller::enableAutoExecution(bool enable, unsigned long interval) {
    if (_activeProfile < _profileCount) {
        _profiles[_activeProfile].autoExecute = enable;
        _profiles[_activeProfile].executeInterval = interval;
    }
}

void NRF24Controller::executeProfiles() {
    // Update all levers first
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        if (_levers[i] != nullptr) {
            _levers[i]->update();
        }
    }
    
    // Execute active profile
    _executeActiveProfile();
}

// DEBUG AND STATUS METHODS
void NRF24Controller::printProfile(uint8_t profileIndex) {
    if (profileIndex >= _profileCount) return;
    
    ControlProfile& profile = _profiles[profileIndex];
    
    Serial.println("===============================");
    Serial.print("Profile: ");
    Serial.println(profile.name);
    Serial.print("Enabled: ");
    Serial.println(profile.enabled ? "Yes" : "No");
    Serial.print("Auto Execute: ");
    Serial.println(profile.autoExecute ? "Yes" : "No");
    Serial.print("Interval: ");
    Serial.print(profile.executeInterval);
    Serial.println("ms");
    
    Serial.println("Joystick Mappings:");
    for (uint8_t i = 0; i < MAX_JOYSTICKS; i++) {
        if (profile.joystickMappings[i][0].enabled || profile.joystickMappings[i][1].enabled) {
            Serial.print("  Joystick ");
            Serial.print(i);
            Serial.print(":");
            if (profile.joystickMappings[i][0].enabled) {
                Serial.print(" X->Ch");
                Serial.print(profile.joystickMappings[i][0].outputChannel);
            }
            if (profile.joystickMappings[i][1].enabled) {
                Serial.print(" Y->Ch");
                Serial.print(profile.joystickMappings[i][1].outputChannel);
            }
            Serial.println();
        }
    }
    
    Serial.println("Lever Mappings:");
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        if (profile.leverMappings[i].enabled) {
            Serial.print("  Lever ");
            Serial.print(i);
            Serial.print(" -> Channel ");
            Serial.println(profile.leverMappings[i].outputChannel);
        }
    }
    
    if (profile.conditionalCount > 0) {
        Serial.println("Conditional Mappings:");
        for (uint8_t i = 0; i < profile.conditionalCount; i++) {
            Serial.print("  When Lever ");
            Serial.print(profile.conditionalMappings[i].conditionLeverId);
            Serial.print(" = ");
            Serial.print(profile.conditionalMappings[i].conditionPosition);
            Serial.print(" -> Channel ");
            Serial.println(profile.conditionalMappings[i].mapping.outputChannel);
        }
    }
    
    Serial.println("===============================");
}

void NRF24Controller::printAllProfiles() {
    Serial.print("Total Profiles: ");
    Serial.println(_profileCount);
    Serial.print("Active Profile: ");
    Serial.println(_activeProfile);
    
    for (uint8_t i = 0; i < _profileCount; i++) {
        printProfile(i);
    }
}

void NRF24Controller::printChannelValues() {
    Serial.println("=== Channel Values ===");
    for (uint8_t i = 0; i < 32; i++) {
        if (_channelUpdated[i]) {
            Serial.print("Ch");
            Serial.print(i);
            Serial.print(": ");
            Serial.print(_channelValues[i]);
            Serial.println();
        }
    }
}

const char* NRF24Controller::getProfileName(uint8_t profileIndex) {
    if (profileIndex < _profileCount) {
        return _profiles[profileIndex].name;
    }
    return "Invalid";
}

