alvaro-tc/esp32-ili9341-controller/lib/NRF24Controller/NRF24Controller.cpp
// QUICK SETUP HELPERS (SUPER EASY!)
void NRF24Controller::quickSetupBasic() {
    uint8_t profile = createProfile("Basic");
    selectProfile(profile);
    
    if (_joystickCount > 0) {
        mapJoystickToChannel(0, true, 0, -100, 100);   // X -> Channel 0
        mapJoystickToChannel(0, false, 1, -100, 100);  // Y -> Channel 1
    }
    
    if (_leverCount > 0) {
        mapLeverToChannel(0, 2, 0, 100);               // Lever -> Channel 2
    }
    
    enableAutoExecution(true, 50);
    Serial.println("Quick Setup: Basic configuration complete!");
}

void NRF24Controller::quickSetupDrone() {
    uint8_t profile = createProfile("Drone");
    selectProfile(profile);
    
    // Typical drone configuration
    mapJoystickToChannel(0, true, 0, -500, 500);      // Roll (aileron)
    mapJoystickToChannel(0, false, 1, -500, 500);     // Pitch (elevator)
    
    if (_joystickCount > 1) {
        mapJoystickToChannel(1, true, 3, -500, 500);   // Yaw (rudder)
    }
    
    if (_leverCount > 0) {
        mapLeverToChannel(0, 2, 1000, 2000);           // Throttle (1000-2000us)
    }
    
    enableAutoExecution(true, 20); // High frequency for drones
    Serial.println("Quick Setup: Drone configuration complete!");
}

void NRF24Controller::quickSetupCar() {
    uint8_t profile = createProfile("Car");
    selectProfile(profile);
    
    mapJoystickToChannel(0, true, 0, -100, 100);      // Steering
    
    if (_leverCount > 0) {
        mapLeverToChannel(0, 1, -100, 100);            // Throttle/Brake
    }
    
    enableAutoExecution(true, 50);
    Serial.println("Quick Setup: Car configuration complete!");
}

void NRF24Controller::quickSetupPlane() {
    uint8_t profile = createProfile("Plane");
    selectProfile(profile);
    
    mapJoystickToChannel(0, true, 0, -100, 100);      // Aileron
    mapJoystickToChannel(0, false, 1, -100, 100);     // Elevator
    
    if (_joystickCount > 1) {
        mapJoystickToChannel(1, true, 2, -100, 100);   // Rudder
    }
    
    if (_leverCount > 0) {
        mapLeverToChannel(0, 3, 0, 100);               // Throttle
    }
    
    enableAutoExecution(true, 50);
    Serial.println("Quick Setup: Plane configuration complete!");
}

// ========== CONFIGURATION AND EEPROM MANAGEMENT IMPLEMENTATION ==========

bool NRF24Controller::saveProfilesToEEPROM(uint16_t startAddress) {
    EEPROMProfileData eepromData;
    
    // Set magic number and version
    eepromData.magicNumber = 0x12345678;
    eepromData.version = 1;
    eepromData.profileCount = _profileCount;
    
    // Copy profiles
    for (uint8_t i = 0; i < 4; i++) {
        eepromData.profiles[i] = _profiles[i];
    }
    
    // Calculate checksum
    eepromData.checksum = 0;
    uint8_t* data = (uint8_t*)&eepromData;
    for (size_t i = 0; i < sizeof(EEPROMProfileData) - sizeof(uint16_t); i++) {
        eepromData.checksum ^= data[i];
    }
    
    // Write to EEPROM
    for (size_t i = 0; i < sizeof(EEPROMProfileData); i++) {
        EEPROM.write(startAddress + i, data[i]);
    }
    
    Serial.print("Profiles saved to EEPROM at address ");
    Serial.println(startAddress);
    return true;
}

bool NRF24Controller::loadProfilesFromEEPROM(uint16_t startAddress) {
    EEPROMProfileData eepromData;
    
    // Read from EEPROM
    uint8_t* data = (uint8_t*)&eepromData;
    for (size_t i = 0; i < sizeof(EEPROMProfileData); i++) {
        data[i] = EEPROM.read(startAddress + i);
    }
    
    // Validate magic number
    if (eepromData.magicNumber != 0x12345678) {
        Serial.println("Invalid EEPROM data - no valid profiles found");
        return false;
    }
    
    // Validate version
    if (eepromData.version != 1) {
        Serial.println("EEPROM version mismatch");
        return false;
    }
    
    // Validate checksum
    uint16_t calculatedChecksum = 0;
    for (size_t i = 0; i < sizeof(EEPROMProfileData) - sizeof(uint16_t); i++) {
        calculatedChecksum ^= data[i];
    }
    
    if (calculatedChecksum != eepromData.checksum) {
        Serial.println("EEPROM checksum mismatch - data corrupted");
        return false;
    }
    
    // Load profiles
    _profileCount = eepromData.profileCount;
    for (uint8_t i = 0; i < 4; i++) {
        _profiles[i] = eepromData.profiles[i];
    }
    
    Serial.print("Loaded ");
    Serial.print(_profileCount);
    Serial.println(" profiles from EEPROM");
    
    return true;
}

void NRF24Controller::clearEEPROMProfiles(uint16_t startAddress) {
    // Write zeros to clear EEPROM
    for (size_t i = 0; i < sizeof(EEPROMProfileData); i++) {
        EEPROM.write(startAddress + i, 0);
    }
    
    Serial.println("EEPROM profiles cleared");
}

bool NRF24Controller::validateEEPROMData(uint16_t startAddress) {
    uint32_t magicNumber;
    uint8_t* data = (uint8_t*)&magicNumber;
    
    for (uint8_t i = 0; i < 4; i++) {
        data[i] = EEPROM.read(startAddress + i);
    }
    
    return (magicNumber == 0x12345678);
}

SystemConfig NRF24Controller::getDefaultConfig() {
    SystemConfig config;
    
    // NRF24 default settings
    config.nrfCEPin = 9;
    config.nrfCSNPin = 10;
    config.nrfChannel = 76;
    config.nrfPowerLevel = POWER_HIGH;
    config.nrfDataRate = RATE_1MBPS;
    config.nrfTxAddress = 0xE8E8F0F0E1LL;
    config.nrfRxAddress = 0xE8E8F0F0E2LL;
    
    // Default joystick configurations
    for (uint8_t i = 0; i < MAX_JOYSTICKS; i++) {
        config.joysticks[i].enabled = false;
        config.joysticks[i].pinX = A0 + i * 2;
        config.joysticks[i].pinY = A1 + i * 2;
        config.joysticks[i].pinButton = 2 + i;
        config.joysticks[i].minX = 0;
        config.joysticks[i].maxX = 4095;
        config.joysticks[i].centerX = 2048;
        config.joysticks[i].minY = 0;
        config.joysticks[i].maxY = 4095;
        config.joysticks[i].centerY = 2048;
        config.joysticks[i].deadZone = 60;
        config.joysticks[i].invertX = false;
        config.joysticks[i].invertY = false;
        config.joysticks[i].smoothingFactor = 0.2;
        snprintf(config.joysticks[i].name, 16, "Joystick%d", i + 1);
    }
    
