alvaro-tc/esp32-ili9341-controller/lib/NRF24Controller/NRF24Controller.cpp
    // Default lever configurations
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        config.levers[i].enabled = false;
        config.levers[i].type = ANALOG_LEVER;
        config.levers[i].pinA = A4 + i;
        config.levers[i].pinB = 255;
        config.levers[i].pinButton = 255;
        config.levers[i].minPosition = 0;
        config.levers[i].maxPosition = 4095;
        config.levers[i].centerPosition = 2048;
        config.levers[i].deadZone = 50;
        config.levers[i].invertDirection = false;
        config.levers[i].smoothingFactor = 0.1;
        config.levers[i].stepsPerDetent = 4;
        config.levers[i].digitalPositions = 3;
        snprintf(config.levers[i].name, 16, "Lever%d", i + 1);
    }
    
    // System settings
    strcpy(config.systemName, "NRF24Controller");
    config.debugMode = false;
    config.transmissionInterval = 50;
    
    return config;
}

bool NRF24Controller::loadSystemConfig(const char* configData) {
    // Parse configuration from string format
    // This is a simplified parser - you might want to use JSON or similar
    
    Serial.println("Parsing configuration data...");
    
    // Create a working copy
    char* workingData = strdup(configData);
    if (!workingData) {
        Serial.println("Memory allocation failed");
        return false;
    }
    
    SystemConfig config = getDefaultConfig();
    
    // Simple line-by-line parser
    char* line = strtok(workingData, "\n");
    while (line != nullptr) {
        // Skip comments and empty lines
        if (line[0] == '#' || line[0] == '\0' || line[0] == ' ') {
            line = strtok(nullptr, "\n");
            continue;
        }
        
        // Parse key-value pairs
        char* key = strtok(line, "=");
        char* value = strtok(nullptr, "=");
        
        if (key && value) {
            // NRF24 settings
            if (strcmp(key, "NRF_CE_PIN") == 0) {
                config.nrfCEPin = atoi(value);
            } else if (strcmp(key, "NRF_CSN_PIN") == 0) {
                config.nrfCSNPin = atoi(value);
            } else if (strcmp(key, "NRF_CHANNEL") == 0) {
                config.nrfChannel = atoi(value);
            } else if (strcmp(key, "NRF_POWER") == 0) {
                if (strcmp(value, "MIN") == 0) config.nrfPowerLevel = POWER_MIN;
                else if (strcmp(value, "LOW") == 0) config.nrfPowerLevel = POWER_LOW;
                else if (strcmp(value, "HIGH") == 0) config.nrfPowerLevel = POWER_HIGH;
                else if (strcmp(value, "MAX") == 0) config.nrfPowerLevel = POWER_MAX;
            }
            // Add more parsing logic as needed...
        }
        
        line = strtok(nullptr, "\n");
    }
    
    free(workingData);
    
    // Apply the configuration
    applySystemConfig(config);
    
    return true;
}

void NRF24Controller::applySystemConfig(const SystemConfig& config) {
    Serial.println("Applying system configuration...");
    
    // Apply NRF24 settings
    _cePin = config.nrfCEPin;
    _csnPin = config.nrfCSNPin;
    _channel = config.nrfChannel;
    _powerLevel = config.nrfPowerLevel;
    _dataRate = config.nrfDataRate;
    _txAddress = config.nrfTxAddress;
    _rxAddress = config.nrfRxAddress;
    
    // Note: Joystick and Lever configurations would need to be applied
    // during object creation, so this function mainly sets internal parameters
    
    Serial.print("Applied configuration for system: ");
    Serial.println(config.systemName);
}

void NRF24Controller::printSystemConfig(const SystemConfig& config) {
    Serial.println("========== SYSTEM CONFIGURATION ==========");
    Serial.print("System Name: "); Serial.println(config.systemName);
    Serial.print("Debug Mode: "); Serial.println(config.debugMode ? "ON" : "OFF");
    
    Serial.println("\n--- NRF24 Settings ---");
    Serial.print("CE Pin: "); Serial.println(config.nrfCEPin);
    Serial.print("CSN Pin: "); Serial.println(config.nrfCSNPin);
    Serial.print("Channel: "); Serial.println(config.nrfChannel);
    Serial.print("Power Level: "); Serial.println(config.nrfPowerLevel);
    Serial.print("Data Rate: "); Serial.println(config.nrfDataRate);
    
    Serial.println("\n--- Joystick Configurations ---");
    for (uint8_t i = 0; i < MAX_JOYSTICKS; i++) {
        if (config.joysticks[i].enabled) {
            Serial.print("Joystick "); Serial.print(i); Serial.print(" (");
            Serial.print(config.joysticks[i].name); Serial.println("):");
            Serial.print("  Pins: X="); Serial.print(config.joysticks[i].pinX);
            Serial.print(", Y="); Serial.print(config.joysticks[i].pinY);
            Serial.print(", Button="); Serial.println(config.joysticks[i].pinButton);
            Serial.print("  Limits X: "); Serial.print(config.joysticks[i].minX);
            Serial.print("-"); Serial.print(config.joysticks[i].maxX);
            Serial.print(", Center: "); Serial.println(config.joysticks[i].centerX);
            Serial.print("  Dead Zone: "); Serial.println(config.joysticks[i].deadZone);
        }
    }
    
    Serial.println("\n--- Lever Configurations ---");
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        if (config.levers[i].enabled) {
            Serial.print("Lever "); Serial.print(i); Serial.print(" (");
            Serial.print(config.levers[i].name); Serial.println("):");
            Serial.print("  Type: "); Serial.println(config.levers[i].type);
            Serial.print("  Pins: A="); Serial.print(config.levers[i].pinA);
            if (config.levers[i].pinB != 255) {
                Serial.print(", B="); Serial.print(config.levers[i].pinB);
            }
            if (config.levers[i].pinButton != 255) {
                Serial.print(", Button="); Serial.print(config.levers[i].pinButton);
            }
            Serial.println();
        }
    }
    
    Serial.println("==========================================");
}

bool NRF24Controller::autoConfigureFromString(const char* configData) {
    SystemConfig config;
    if (loadSystemConfig(configData)) {
        initializeFromConfig(config);
        return true;
    }
    return false;
}

void NRF24Controller::initializeFromConfig(const SystemConfig& config) {
    // This would create and configure joysticks and levers based on config
    // Implementation depends on how you want to handle dynamic object creation
    Serial.println("Initializing system from configuration...");
    
    applySystemConfig(config);
    
    Serial.println("System initialization complete");
}

