alvaro-tc/esp32-ili9341-controller/lib/NRF24Controller/NRF24Controller.cpp
void NRF24Controller::saveJoystickCalibration(uint8_t joystickId) {
    if (joystickId >= MAX_JOYSTICKS || _joysticks[joystickId] == nullptr) {
        return;
    }
    
    // Save calibration data to EEPROM
    uint16_t address = 1000 + (joystickId * 20); // Offset for calibration data
    
    Joystick* joy = _joysticks[joystickId];
    EEPROM.write(address, joy->getMinX() & 0xFF);
    EEPROM.write(address + 1, (joy->getMinX() >> 8) & 0xFF);
    EEPROM.write(address + 2, joy->getMaxX() & 0xFF);
    EEPROM.write(address + 3, (joy->getMaxX() >> 8) & 0xFF);
    EEPROM.write(address + 4, joy->getCenterX() & 0xFF);
    EEPROM.write(address + 5, (joy->getCenterX() >> 8) & 0xFF);
    
    EEPROM.write(address + 10, joy->getMinY() & 0xFF);
    EEPROM.write(address + 11, (joy->getMinY() >> 8) & 0xFF);
    EEPROM.write(address + 12, joy->getMaxY() & 0xFF);
    EEPROM.write(address + 13, (joy->getMaxY() >> 8) & 0xFF);
    EEPROM.write(address + 14, joy->getCenterY() & 0xFF);
    EEPROM.write(address + 15, (joy->getCenterY() >> 8) & 0xFF);
    
    Serial.print("Saved calibration for joystick ");
    Serial.println(joystickId);
}

void NRF24Controller::saveLeverCalibration(uint8_t leverId) {
    if (leverId >= MAX_LEVERS || _levers[leverId] == nullptr) {
        return;
    }
    
    // Save lever calibration data
    uint16_t address = 1200 + (leverId * 20);
    
    Lever* lever = _levers[leverId];
    EEPROM.write(address, lever->getMinPosition() & 0xFF);
    EEPROM.write(address + 1, (lever->getMinPosition() >> 8) & 0xFF);
    EEPROM.write(address + 2, lever->getMaxPosition() & 0xFF);
    EEPROM.write(address + 3, (lever->getMaxPosition() >> 8) & 0xFF);
    EEPROM.write(address + 4, lever->getCenterPosition() & 0xFF);
    EEPROM.write(address + 5, (lever->getCenterPosition() >> 8) & 0xFF);
    
    Serial.print("Saved calibration for lever ");
    Serial.println(leverId);
}

void NRF24Controller::loadCalibrations() {
    // Load joystick calibrations
    for (uint8_t i = 0; i < MAX_JOYSTICKS; i++) {
        if (_joysticks[i] != nullptr) {
            uint16_t address = 1000 + (i * 20);
            
            int minX = EEPROM.read(address) | (EEPROM.read(address + 1) << 8);
            int maxX = EEPROM.read(address + 2) | (EEPROM.read(address + 3) << 8);
            int centerX = EEPROM.read(address + 4) | (EEPROM.read(address + 5) << 8);
            
            int minY = EEPROM.read(address + 10) | (EEPROM.read(address + 11) << 8);
            int maxY = EEPROM.read(address + 12) | (EEPROM.read(address + 13) << 8);
            int centerY = EEPROM.read(address + 14) | (EEPROM.read(address + 15) << 8);
            
            // Apply calibration if valid
            if (minX != 0 && maxX != 0) {
                _joysticks[i]->setLimits(minX, maxX, minY, maxY);
                _joysticks[i]->setCenter(centerX, centerY);
            }
        }
    }
    
    // Load lever calibrations
    for (uint8_t i = 0; i < MAX_LEVERS; i++) {
        if (_levers[i] != nullptr) {
            uint16_t address = 1200 + (i * 20);
            
            int minPos = EEPROM.read(address) | (EEPROM.read(address + 1) << 8);
            int maxPos = EEPROM.read(address + 2) | (EEPROM.read(address + 3) << 8);
            int centerPos = EEPROM.read(address + 4) | (EEPROM.read(address + 5) << 8);
            
            if (minPos != 0 && maxPos != 0) {
                _levers[i]->setAnalogLimits(minPos, maxPos, centerPos);
            }
        }
    }
    
    Serial.println("Calibrations loaded from EEPROM");
}

void NRF24Controller::backupCurrentSettings() {
    // Backup current profiles and settings
    saveProfilesToEEPROM(0);
    
    Serial.println("Current settings backed up to EEPROM");
}

bool NRF24Controller::restoreSettings() {
    if (validateEEPROMData(0)) {
        loadProfilesFromEEPROM(0);
        loadCalibrations();
        Serial.println("Settings restored from EEPROM");
        return true;
    }
    
    Serial.println("No valid backup found in EEPROM");
    return false;
}

void NRF24Controller::factoryReset() {
    // Clear all EEPROM data
    clearEEPROMProfiles(0);
    
    // Reset to default profiles
    _initializeProfiles();
    _activeProfile = 0;
    _profileCount = 0;
    
    Serial.println("Factory reset complete");
}